Revit 2027 API
DirectShapeType.HasExternalGeometry Method
 Checks whether the externally tagged geometry is already present in this DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasExternalGeometry(
	ExternalGeometryId externalId
)
Public Function HasExternalGeometry (
	externalId As ExternalGeometryId
) As Boolean
public:
bool HasExternalGeometry(
	ExternalGeometryId^ externalId
)
member HasExternalGeometry :
        externalId : ExternalGeometryId -> bool
Parameters
externalId ExternalGeometryId
 The external ID of the externally tagged geometry to check.
Return Value
Boolean
 True if such an externally tagged geometry is already present in this DirectShapeType, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace